Repository: MauricioFauth/sql-parser
Catalog: locale/*/LC_MESSAGES/sqlparser.po
Languages: ckb, fi, ko, ta

source: Not implemented yet.
ckb: هێشتا جێبەجێ نەکراوە.
fi: Ei vielä toteutettu.
ko: 아직 구현되지 않은 기능입니다.
ta: இன்னும் அமுலாக்கப்படவில்லை.

source: A new statement was found, but no delimiter between it and the previous one.
ckb: بەیاننامەیەکی نوێ دۆزرایەوە، بەڵام هیچ سنووردارکەرێک لە نێوان ئەو و لێدوانەکەی پێشوودا نەبوو.
fi: Löydettiin uusi lauseke, muttei erotinta sen ja sitä edeltäneen välillä.
ko: 새로운 문장이 발견되었지만, 이전 문장과의 구분기호가 없습니다.
ta: ஒரு புதிய அறிக்கை கண்டுபிடிக்கப்பட்டது, ஆனால் அதற்கும் முந்தைய இடத்திற்கும் இடையில் எந்த டிலிமிட்டரும் இல்லை.

source: Missing comma before start of a new alter operation.
ckb: کۆما ونبوو پێش دەستپێکردنی ئۆپەراسیۆنی گۆڕینی نوێ.
fi: Pilkku puuttuu ennen uuden muutostoiminnon aloittamista.
ko: 새로운 ALTER 작업의 시작 앞에 쉼표가 빠졌습니다.
ta: மாற்றம் செய்விக்கும் முன்னருக்கான காற்புள்ளி காணப்படவில்லை.

source: Unrecognized alter operation.
ckb: کارکردنی گۆڕینی نەناسراو.
fi: Tunnistamaton "alter"-toiminto.
ko: 인식할 수 없는 ALTER 작업입니다.
ta: அங்கீகரிக்கப்படாத மாற்று செயல்பாடு.

source: %1$d values were expected, but found %2$d.
ckb: بەهاکانی %1$d چاوەڕوان دەکران، بەڵام %2$d دۆزرایەوە.
fi: Odotettiin arvoa %1$d , mutta löydettiin %2$d.
ko: 값 %1$d이 필요하지만, %2$d 가 있습니다.
ta: %1$d மதிப்புகள் எதிர்பார்க்கப்பட்டன, ஆனால் %2$d ஐக் கண்டறிந்தது.

source: An opening bracket followed by a set of values was expected.
ckb: چاوەڕوان دەکرا کە بڕاکێتێکی کردنەوەی کە کۆمەڵێک بەها بەدوایدا هاتبێت.
fi: Odotettiin aloitussulkua, jota seuraa joukko arvoja.
ko: 왼쪽 괄호 뒤에 여러 값들이 필요합니다.
ta: ஒரு தொடக்க அடைப்புக்குறி மதிப்புகளின் தொகுப்பைத் தொடர்ந்து எதிர்பார்க்கப்பட்டது.

source: An opening bracket was expected.
ckb: چاوەڕوان دەکرا بڕاکێتێکی کردنەوەی یارییەکە بێت.
fi: Odotettiin ensimmäistä hakasulkua.
ko: 왼쪽 괄호가 필요합니다.
ta: ஒரு திறப்பு அடைப்புக்குறி எதிர்பார்க்கப்பட்டது.

source: Unexpected keyword.
ckb: وشەی سەرەکی چاوەڕواننەکراو.
fi: Odottamaton avainsana.
ko: 예기치 않은 키워드입니다.
ta: எதிர்பாராத சிறப்புச்சொல்.

source: Unexpected end of CASE expression
ckb: کۆتایی چاوەڕواننەکراوی دەربڕینی کەیس
fi: Odottamaton loppu CASE-ilmaisulle
ko: 예기치 않은 CASE 문의 끝입니다
ta: வழக்கு வெளிப்பாட்டின் எதிர்பாராத முடிவு

source: Potential duplicate alias of CASE expression.
ckb: ناوی نادیاری دووبارەبوونەوەی پۆتانسێلی دەربڕینی کەیس.
fi: CASE-lausekkeen mahdollinen kaksoisalias.
ko: CASE 문의 별칭이 중복되었을 수 있습니다.
ta: வழக்கு வெளிப்பாட்டின் சாத்தியமான நகல் மாற்றுப்பெயர்.

source: An alias expected after AS but got
ckb: ناوی نادیارێک کە چاوەڕوان دەکرا دوای AS بەڵام بەدەستی هێنا
fi: Alias odotettiin AS:n jälkeen, mutta sai
ko: AS 다음에 별칭이 필요하지만, 다음 내용이 있습니다
ta: ஒரு மாற்றுப்பெயர் எதிர்பார்க்கப்பட்டது ஆனால் கிடைத்தது

source: An alias was previously found.
ckb: پێشتر ناوێکی نادیار دۆزرایەوە.
fi: Alias löytyi aiemmin.
ko: 이미 사용 중인 별칭입니다.
ta: ஒரு மாற்றுப்பெயர் முன்பு கண்டுபிடிக்கப்பட்டது.

source: An alias was expected after AS.
ckb: چاوەڕوان دەکرا ناوی نادیار لە دوای AS.
fi: AS:n jälkeen odotettiin alias.
ko: AS뒤에 별칭이 필요합니다.
ta: அச் க்குப் பிறகு ஒரு மாற்றுப்பெயர் எதிர்பார்க்கப்பட்டது.

source: A symbol name was expected! A reserved keyword can not be used as a column name without backquotes.
ckb: ناوێکی هێما چاوەڕوان دەکرا! وشەی سەرەکی یەدەگ ناتوانرێت وەک ناوی ستوونی بەکاربهێنرێت بەبێ پاشکۆ.
fi: Symbolinimeä odotettiin! Varattua avainsanaa ei voi käyttää sarakkeen nimenä ilman lainausmerkkejä.
ko: 식별할 수 있는 이름이 필요합니다! 예약어는 역따옴표 없이 열 이름으로 사용될 수 없습니다.
ta: ஒரு குறியீட்டு பெயர் எதிர்பார்க்கப்பட்டது! முன்பதிவு செய்யப்பட்ட முக்கிய சொல்லை பின்னணி இல்லாமல் நெடுவரிசை பெயராகப் பயன்படுத்த முடியாது.

source: A symbol name was expected!
ckb: ناوێکی هێما چاوەڕوان دەکرا!
fi: Odotettiin symbolinimeä!
ko: 식별할 수 있는 이름이 필요합니다!
ta: அடையாளம் ஒன்று எதிர்பார்க்கப்பட்டது!

source: A comma or a closing bracket was expected.
ckb: کۆما یان بڕاکێتی داخستنی چاوەڕوان دەکرا.
fi: Odotettiin pilkkua tai sulkumerkkiä.
ko: 쉼표 또는 닫는 대괄호가 필요합니다.
ta: ஒரு காற்புள்ளி அல்லது மூடும் அடைப்புக்குறி எதிர்பார்க்கப்பட்டது.

source: A closing bracket was expected.
ckb: چاوەڕوان دەکرا کە بڕاکێتی داخستنی کۆتایی بێت.
fi: Odotettiin sulkumerkkiä.
ko: 닫는 괄호가 필요합니다.
ta: ஒரு மூடும் அடைப்புக்குறி எதிர்பார்க்கப்பட்டது.

source: Unrecognized data type.
ckb: جۆری داتا نەناسراو.
fi: Tunnistamaton datatyyppi.
ko: 인식할 수 없는 데이터 형식입니다.
ta: அங்கீகரிக்கப்படாத தரவு வகை.

source: An expression was expected.
ckb: دەربڕینێک چاوەڕوان دەکرا.
fi: Odotettiin ilmaisua.
ko: 식이 필요합니다.
ta: ஒரு வெளிப்பாடு எதிர்பார்க்கப்பட்டது.

source: An alias was expected.
ckb: چاوەڕوان دەکرا ناوی نادیارێک بێت.
fi: Odotettiin aliasta.
ko: 별칭이 필요합니다.
ta: ஒரு மாற்றுப்பெயர் எதிர்பார்க்கப்பட்டது.

source: Unexpected dot.
ckb: خاڵێکی چاوەڕواننەکراو.
fi: Odottamaton piste.
ko: 예기치 못한 마침표(.)입니다.
ta: எதிர்பாராத புள்ளி.

source: Unexpected token.
ckb: نیشانەیەکی چاوەڕواننەکراو.
fi: Odottamaton merkki.
ko: 예기치 못한 토큰입니다.
ta: எதிர்பாராத கிள்ளாக்கு.

source: An offset was expected.
ckb: چاوەڕوان دەکرا ئۆفسێتێک بێت.
ko: 오프셋이 필요합니다.
ta: ஒரு ஆஃப்செட் எதிர்பார்க்கப்பட்டது.

source: Unexpected end of LOCK expression.
ckb: کۆتایی چاوەڕواننەکراوی دەربڕینی قوفڵ.
fi: Odottamaton loppu LOCK-ilmaisulle.
ko: 예기치 않은 LOCK 표현식 종료입니다.
ta: பூட்டு வெளிப்பாட்டின் எதிர்பாராத முடிவு.

source: This option conflicts with "%1$s".
ckb: ئەم هەڵبژاردنە لەگەڵ "%1$s" ناکۆکە.
fi: Tämä vaihtoehto on ristiriidassa "%1$s":n kanssa.
ko: 이 옵션은 "%1$s" 옵션과 충돌합니다.
ta: இந்த விருப்பம் "%1$s" உடன் முரண்படுகிறது.

source: The old name of the table was expected.
ckb: ناوی کۆنی خشتەکە چاوەڕوان دەکرا.
fi: Odotettiin vanhaa taulunimeä.
ko: 테이블의 이전 이름이 필요합니다.
ta: அட்டவணையின் பழைய பெயர் எதிர்பார்க்கப்பட்டது.

source: Keyword "TO" was expected.
ckb: وشەی سەرەکی "TO" چاوەڕوان دەکرا.
fi: Avainsanaa "TO" odotettiin.
ko: "TO" 키워드가 필요합니다.
ta: "To" என்ற முக்கிய சொல் எதிர்பார்க்கப்பட்டது.

source: The new name of the table was expected.
ckb: ناوی نوێی خشتەکە چاوەڕوان دەکرا.
fi: Odotettiin uutta taulunimeä.
ko: 테이블의 새로운 이름이 필요합니다.
ta: அட்டவணையின் புதிய பெயர் எதிர்பார்க்கப்பட்டது.

source: A rename operation was expected.
ckb: چاوەڕوان دەکرا ئۆپەراسیۆنی گۆڕینی ناوەکە ئەنجام بدرێت.
fi: Odotettiin uudelleennimeämistoimintoa.
ko: 이름 바꾸기 작업이 필요합니다.
ta: பெயர் மாற்றத்திற்கான செயல் எதிர்பார்க்கப்பட்டது.

source: Missing expression.
ckb: دەربڕینی ونبوون.
fi: Puuttuva lauseke.
ko: 구문이 없습니다.
ta: காணப்படாத வெளிப்பாடு.

source: Unexpected character.
ckb: کارەکتەری چاوەڕوان نەکراو.
fi: Odottamatton merkki.
ko: 예기치 않은 문자입니다.
ta: எதிர்பாராத தன்மை.

source: Expected whitespace(s) before delimiter.
ckb: بۆشایی سپی چاوەڕوانکراو پێش سنووردارکەر.
fi: Odotettu välilyöntejä ennen erotinta.
ko: 구분기호 앞에 공백이 필요합니다.
ta: டிலிமிட்டருக்கு முன் எதிர்பார்க்கப்படும் இடைவெளி (கள்).

source: Expected delimiter.
ckb: سنووردارکەری چاوەڕوانکراو.
fi: Odotettu erotin.
ko: 구분기호가 필요합니다.
ta: எதிர்பார்க்கப்படும் டிலிமிட்டர்.

source: Ending quote %1$s was expected.
ckb: کۆتایی هاتنی کۆتی %1$s چاوەڕوان دەکرا.
fi: Odotettiin loppumerkkiä %1$s.
ko: 닫는 따옴표 %1$s 가 필요합니다.
ta: முடிவு மேற்கோள் %1$s எதிர்பார்க்கப்பட்டது.

source: Variable name was expected.
ckb: ناوی گۆڕاو چاوەڕوان دەکرا.
fi: Odotettiin muuttujaa.
ko: 변수명이 필요합니다.
ta: மாறி பெயர் எதிர்பார்க்கப்பட்டது.

source: Unexpected beginning of statement.
ckb: سەرەتای چاوەڕواننەکراوی لێدوان.
fi: Odottamaton ilmaisun alku.
ko: 예기치 않은 구문 시작합니다.
ta: அறிக்கையின் எதிர்பாராத துவக்கம்.

source: Unrecognized statement type.
ckb: جۆری ڕستەی نەناسراو.
fi: Tuntematon lausuntotyyppi.
ko: 인식할 수 없는 명령문 유형입니다.
ta: அங்கீகரிக்கப்படாத அறிக்கை வகை.

source: No transaction was previously started.
ckb: پێشتر هیچ مامەڵەیەک دەستی پێنەکردبوو.
fi: Tapahtumaa ei ole aloitettu aiemmin.
ko: 이전에 시작한 트랜잭션이 없습니다.
ta: எந்த பரிவர்த்தனையும் முன்பு தொடங்கப்படவில்லை.

source: This type of clause was previously parsed.
ckb: ئەم جۆرە بڕگەیە پێشتر شیکرابووەوە.
fi: Tämän tyyppinen lauseke jäsennettiin aiemmin.
ko: 이 유형의 절은 이미 파싱되었습니다.
ta: இந்த வகை பிரிவு முன்பு பாகுபடுத்தப்பட்டது.

source: Unrecognized keyword.
ckb: وشەی سەرەکی نەناسراو.
fi: Tuntematon avainsana.
ko: 인식할 수 없는 키워드입니다.
ta: அங்கீகரிக்கப்படாத முக்கிய சொல்.

source: Keyword at end of statement.
ckb: وشەی سەرەکی لە کۆتایی بەیاننامەکەدا.
fi: Avainsana lausunnon lopussa.
ko: 구문의 끝에 있는 키워드입니다.
ta: அறிக்கையின் முடிவில் முக்கிய சொல்.

source: Unexpected ordering of clauses.
ckb: ڕێکوپێکی چاوەڕواننەکراوی بڕگەکان.
fi: Lausekkeiden odottamaton järjestys.
ko: 예기치 않은 절의 순서입니다.
ta: உட்பிரிவுகளின் எதிர்பாராத வரிசைப்படுத்தல்.

source: The name of the entity was expected.
ckb: ناوی قەوارەکە چاوەڕوان دەکرا.
fi: Entiteetin nimeä odotettiin.
ko: 개체 이름이 필요합니다.
ta: நிறுவனத்தின் பெயர் எதிர்பார்க்கப்பட்டது.

source: A table name was expected.
ckb: ناوی خشتەیەک چاوەڕوان دەکرا.
fi: Taulukon nimeä odotettiin.
ko: 테이블 이름이 필요합니다.
ta: ஒரு அட்டவணை பெயர் எதிர்பார்க்கப்பட்டது.

source: At least one column definition was expected.
ckb: بەلایەنی کەمەوە یەک پێناسەی ستوونی چاوەڕوان دەکرا.
fi: Ainakin yksi sarakemäärittely odotettiin.
ko: 최소한 하나의 열은 정의해야합니다.
ta: குறைந்தது ஒரு நெடுவரிசை வரையறை எதிர்பார்க்கப்பட்டது.

source: A "RETURNS" keyword was expected.
ckb: وشەیەکی سەرەکی "RETURNS" چاوەڕوان دەکرا.
fi: Avainsanaa "RETURNS" odotettiin.
ko: "RETURNS"키워드가 필요합니다.
ta: ஒரு "வருமானம்" முக்கிய சொல் எதிர்பார்க்கப்பட்டது.

source: This type of clause is not valid in Multi-table queries.
ckb: ئەم جۆرە بڕگەیە لە پرسیارەکانی Multi-tableدا کاریگەر نییە.
fi: Tämäntyyppinen lauseke ei kelpaa usean taulukon kyselyissä.
ko: 다중테이블 요청에서 이 유형의 절은 유효하지 않습니다.
ta: பல அட்டவணை வினவல்களில் இந்த வகை பிரிவு செல்லுபடியாகாது.

source: Unexpected end of LOCK statement.
ckb: بەیاننامەی کۆتایی چاوەڕواننەکراوی قوفڵ.
fi: LOCK-lausekkeen odottamaton loppu.
ko: 예기치 않은 LOCK 구문의 끝입니다.
ta: பூட்டு அறிக்கையின் எதிர்பாராத முடிவு.

source: Unexpected keyword
ckb: وشەی سەرەکی چاوەڕواننەکراو
fi: Odottamaton avainsana
ko: 예기치 않은 키워드
ta: எதிர்பாராத முக்கிய சொல்

source: The name of the CTE was expected.
ckb: ناوی CTE چاوەڕوان دەکرا.
fi: CTE:n nimeä odotettiin.
ko: CTE의 이름이 필요합니다.
ta: CTE இன் பெயர் எதிர்பார்க்கப்பட்டது.

source: AS keyword was expected.
ckb: وشەی سەرەکی AS چاوەڕوان دەکرا.
fi: AS-avainsana odotettiin.
ko: AS 키워드가 필요합니다.
ta: முக்கிய சொல் எதிர்பார்க்கப்பட்டது.

source: Subquery of the CTE was expected.
ckb: چاوەڕوان دەکرا پرسیاری لاوەکی لە CTE بکرێت.
fi: CTE:n alikyselyä odotettiin.
ko: CTE의 서브쿼리가 필요합니다.
ta: CTE இன் துணைக்குழு எதிர்பார்க்கப்பட்டது.

source: Unexpected end of the WITH CTE.
ckb: کۆتایی چاوەڕواننەکراوی لەگەڵ CTE.
fi: WITH CTE:n odottamaton loppu.
ko: 예기치 않은 WITH CTE의 끝입니다.
ta: CTE உடன் எதிர்பாராத முடிவு.
